# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg' # https://github.com/ZachNagengast/dotfiles/blob/master/brew-install.sh
brew 'gh'
brew 'git'
brew 'git-recent'
brew 'goto'
brew 'grep'
brew 'httpie'
brew 'jq'
brew 'kubectl'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'mysql-client'
brew 'pipx'
brew 'pyenv' # https://opensource.com/article/19/5/python-3-default-mac
brew 'pyenv-virtualenv'
brew 'ripgrep' # https://ddbeck.com/better-than-grep-for-writers/
brew 'svn'
brew 'terminal-notifier'
brew 'thefuck'
brew 'tldr'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'wget'
brew 'youtube-dl'
brew 'zlib'

# Development
brew 'python'
brew 'r'
brew 'scala'
brew 'php'
brew 'composer'
brew 'node'

# Apps
cask '1password'
cask '1password-cli'
cask 'aerial'
cask 'authy'
cask 'bartender'
cask 'caffeine'
cask 'camo-studio'
cask 'dash'
cask 'datagrip'
# cask 'dbngin'
cask 'docker'
cask 'gifox'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'keybase'
cask 'kitty'
cask 'notion'
cask 'obsidian'
cask 'phpstorm'
cask 'postgres'
cask 'pycharm'
cask 'screenflow'
cask 'slack'
cask 'snowflake-snowsql'
cask 'spotify'
cask 'sublime-text'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'thingsmacsandboxhelper'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005
mas 'BetterSnapTool', id: 417375580
mas 'Microsoft Outlook', id: 985367838
mas 'Microsoft Excel', id: 462058435
