# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'fishtown-analytics/dbt'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'dbt'
brew 'ffmpeg' # https://github.com/ZachNagengast/dotfiles/blob/master/brew-install.sh
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure

# Development
brew 'python'
brew 'r'
brew 'scala'
brew 'php'
brew 'composer'
brew 'node'

# Apps
cask '1password'
cask '1password-cli'
cask 'aerial'
cask 'bartender'
cask 'caffeine'
cask 'datagrip'
cask 'dbngin'
cask 'docker'
cask 'gifox'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'phpstorm'
cask 'screenflow'
cask 'slack'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'thingsmacsandboxhelper'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoomus'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005
mas 'BetterSnapTool', id: 417375580
