# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'dbt-labs/dbt'
tap 'hashicorp/tap'
tap 'epk/epk'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'jakehilborn/jakehilborn/displayplacer'
brew 'delta'
brew 'duckdb'
brew 'ffmpeg' # https://github.com/ZachNagengast/dotfiles/blob/master/brew-install.sh
brew 'fzf'
brew 'gh'
brew 'git-recent'
brew 'grep'
brew 'httpie'
brew 'jq'
brew 'lsd'
brew 'yq'
brew 'k9s'
brew 'kind'
brew 'kubectl'
brew 'mackup'
brew 'neovim'
brew 'pipx'
brew 'pure'
brew 'ripgrep' # https://ddbeck.com/better-than-grep-for-writers/
brew 'hashicorp/tap/terraform'
brew 'tmux'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
# brew 'uv' # curl -LsSf https://astral.sh/uv/install.sh | sh
brew 'wget'
brew 'youtube-dl'
brew 'zlib'

# Development
brew 'java'

# Apps
# cask '1password'
# cask '1password-cli'
# cask 'arc'
# # cask 'aerial'
# # cask 'bartender'
# cask 'cleanshot'
# cask 'copilot'
# cask 'dbngin'
# cask 'figma'
# cask 'flyctl'
# cask 'font-sf-mono-nerd-font'
# cask 'herd'
# cask 'imageoptim'
# cask 'iina'
# cask 'iterm2'
# cask 'kitty'
# cask 'notion'
# cask 'obsidian'
# cask 'orbstack'
# cask 'raycast'
# cask 'slack'
# # cask 'snowflake-snowsql' # fails: `sudo softwareupdate --install-rosetta`
# cask 'spotify'
# cask 'sublime-text'
# cask 'tableplus'
# cask 'telegram-desktop'
# cask 'the-unarchiver'
# cask 'visual-studio-code'
# cask 'zoom'

# Quicklook
# cask 'qlcolorcode'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'quicklook-csv'
# cask 'qlstephen'

# Fonts (requires svn)
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'

# Mac App Store
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Things', id: 904280696
# mas 'BetterSnapTool', id: 417375580
# mas 'Microsoft Outlook', id: 985367838
# mas 'Microsoft Excel', id: 462058435
